app/views/recommendations/index.html.erb

    <br>
    <% values = Recommendation.count%>
---
SELECT "recommendations".* FROM "recommendations"
SELECT COUNT(*) FROM "recommendations"