app/views/calculator/show.html.erb

SELECT "users".* FROM "users" WHERE "users"."calculator_id" = ?  [["calculator_id", 1]]
---
        <tbody>
        <% @calculator.users.each do |item| %>