app/controllers/calculator_controller.rb

    def show
        @calculator = Calculator.find(params[:id])
---
SELECT  "calculators".* FROM "calculators" WHERE "calculators"."id" = ? LIMIT ?  [["id", 0], ["LIMIT", 1]]

    def new
        begin
            @calculator = Calculator.find(params[:calculator_id])
---
SELECT  "calculators".* FROM "calculators" WHERE "calculators"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

    def create
        begin
            @calculator = Calculator.find(params[:calculator_id])
        rescue
            redirect_to home_url, alert: 'Error: Calculator not found'
        end
        @user = User.new(params.permit(:comment))
        @calculator.users << @user
---
SELECT  "calculators".* FROM "calculators" WHERE "calculators"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
INSERT INTO "users" ("comment", "created_at", "updated_at", "calculator_id") VALUES (?, ?, ?, ?)  [["comment", "Hi"], ["created_at", "2018-12-08 01:21:42.847184"], ["updated_at", "2018-12-08 01:21:42.847184"], ["calculator_id", 1]]