app/controllers/recommendations_controller.rb

    def index
        @recommendations = Recommendation.all
---
SELECT "recommendations".* FROM "recommendations"

    def create
        @recommendations = Recommendation.new(params.permit(:subject, :comment, :recommend))
        if @recommendations.save
---
INSERT INTO "recommendations" ("subject", "comment", "recommend", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["subject", "Hello"], ["comment", "Hello"], ["recommend", "Hello"], ["created_at", "2018-12-12 00:14:45.716658"], ["updated_at", "2018-12-12 00:14:45.716658"]]